[{"question_score": 112, "title": "How to automatically remove trailing whitespace in Visual Studio 2008?", "answer_score": 58, "question_body": "<p>Is it possible to configure Visual Studio 2008 to automatically remove whitespace characters at the end of each line when saving a file? There doesn't seem to be a built-in option, so are there any extensions available to do this?</p>\n", "answer": "CodeMaid is a very popular Visual Studio extension and does this automatically\nalong with other useful cleanups. * Download:\nhttps://github.com/codecadwallader/codemaid/releases/tag/v0.4.3 *\nDocumentation: http://www.codemaid.net/documentation/#cleaning I set it to\nclean up a file on save, which I believe is the default.\n\n", "question_id": 82971}, {"question_score": 186, "title": "Changing Ctrl + Tab behavior for moving between documents in Visual Studio", "answer_score": 132, "question_body": "<p>Is it possible to change how <kbd>Ctrl</kbd> + <kbd>Tab</kbd> and <kbd>Shift</kbd> + <kbd>Ctrl</kbd> + <kbd>Tab</kbd> work in Visual Studio? I have disabled the popup navigator window, because I only want to switch between items in the tab control. My problem is the inconsistency of what switching to the next and previous document do.</p>\n\n<p>Every other program that uses a tab control for open document I have seen uses <kbd>Ctrl</kbd> + <kbd>Tab</kbd> to move from left to right and <kbd>Shift</kbd> + <kbd>Ctrl</kbd> + <kbd>Tab</kbd> to go right to left. Visual Studio breaks this with its jump to the last tab selected. You can never know what document you will end up on, and it is never the same way twice. </p>\n\n<p>It is very counterintuitive. Is this a subtle way to encourage everyone to only ever have two document open at once?</p>\n\n<hr>\n\n<p>Let's say I have a few files open. I am working in one, and I need to see what is in the next tab to the right. In every other single application on the face of the Earth, <kbd>Ctrl</kbd> + <kbd>Tab</kbd> will get me there. But in Visual Studio, I have no idea which of the other tabs it will take me to. If I only ever have two documents open, this works great. As soon as you go to three or more, all bets are off as to what tab Visual Studio has decided to send you to. </p>\n\n<p>The problem with this is that I shouldn't have to think about the tool, it should fade into the background, and I should be thinking about the task. The current tab behavior keeps pulling me out of the task and makes me have to pay attention to the tool.</p>\n", "answer": "In Visual Studio 2015 (as well as previous versions of VS, but you must\ninstall Productivity Power Tools if you're using VS2013 or below), there are\ntwo new commands in Visual Studio: _Window.NextTab_ and _Window.PreviousTab_\nJust go remap them from Ctrl+Alt+PageUp/Ctrl+Alt+PageDown to\nCtrl+Tab/Ctrl+Shift+Tab in: Menu _Tools_ -> _Options_ -> _Environment_ ->\n_Keyboard_ Note: In earlier versions such as Visual Studio 2010,\nWindow.NextTab and Window.PreviousTab were named _Window.NextDocumentWellTab_\nand _Window.PreviousDocumentWellTab_.\n\n", "question_id": 21027}, {"question_score": 27, "title": "C# VS2010 Entering break mode failed", "answer_score": 49, "question_body": "<p>I was having some problems with my breakpoints later in my program saying that they would not be hit because the source code and the compiled code was different. I decided to put a break point on my public MainWindow() function, and see what happened.</p>\n\n<p>Now I get the error that Entering break mode failed for the following reason: Source file 'F:\\cAdmin\\OO\\OO\\MainWindow.xaml.cs' does not belong to the project being debugged.</p>\n\n<p>I find this funny because my project is stored on my flash drive (L:) and not F:. </p>\n\n<p>I have rebuilt my project and cleaned it (many times), restarted my computer, moved my Flash drive, and anything else that I can think of.</p>\n", "answer": "Delete the solution user options (.suo) file. If you experience \"funny\"\ndebugging issues, it usually means the suo file is corrupt. Delete the\nsolutions suo file. This has fixed weird debugging problems with breakpoints\nevery time for me. Note, you will lose your solution settings, such as\nbookmarks, breakpoints, and such. See Visual Studio 2008 - The breakpoint\ncannot be hit.\n\n", "question_id": 7021116}, {"question_score": 22, "title": "How to get Visual Studio 2010 to highlight instances of a variable", "answer_score": 21, "question_body": "<p>I'm new using vs2010 I've read that when you click on a variable its suppose to highlight all the instances of that variable in that file and highlight red or show an error as well where the number line is located. How can I get vs2010 to do this because by default it doesn't do that for me and it would be great for the highlighting to work. Thanks.</p>\n", "answer": "The **Highlight all occurrences of selected word** extension in Visual Studio\nGallery does just that. ![Highlight all occurrences of selected\nword](http://i.stack.imgur.com/cfMzD.png)\n\n", "question_id": 9435642}, {"question_score": 74, "title": "Dependency graph of Visual Studio projects", "answer_score": 27, "question_body": "<p>I'm currently migrating a big solution (~70 projects) from VS 2005 + .NET 2.0 to VS 2008 + .NET 3.5. Currently I have VS 2008 + .NET 2.0.</p>\n\n<p>The problem is that I need to move projects one by one to new .NET framework ensuring that no .NET 2.0 project references .NET 3.5 project. Is there any tool that would give me a nice graph of project dependencies?</p>\n", "answer": "Have you tried NDepend? It'll shows you the dependencies and you can also\nanalyze the usability of your classes and methods. Their website:\nhttp://ndepend.com\n\n", "question_id": 598129}, {"question_score": 37, "title": "VisualStudio: Shortcut for when Renaming Variable", "answer_score": 53, "question_body": "<p>In Visual Studio, when you rename a variable name in its definition, there's a little underline in the last letter so if you hover that, you'll get the option \"Rename OldVaribleName to NewVariableName\" and so rename all entries in that procedure of that variable.</p>\n\n<p>Is there a shortcut for that and not use the mouse?</p>\n", "answer": "These are known as Smart Tags. You can use CTRL+. Shift+Alt+F10 is another\noption.\n\n", "question_id": 1098654}, {"question_score": 76, "title": "Visual Studio displaying errors even if projects build", "answer_score": 85, "question_body": "<p>I have a problem with Visual Studio 2013 on a C# solution. It displays totally random errors, but the projects build. Right now, I have 33 files with errors, and I can see red squiggly lines in all of them. </p>\n\n<p>I tried cleaning / rebuilding the solution, closing Visual Studio and even restarting my computer. I also made sure to do the steps described in <a href=\"http://stackoverflow.com/questions/5814783/debugging-runs-even-with-compilers-errors-in-visual-studio\">Debugging runs even with compiler&#39;s errors in Visual Studio</a>. I can modify .cs files and I see the changes in the solution.</p>\n\n<p>Does anyone have an idea about why it does that?</p>\n", "answer": "Apparently, emptying the ReSharper cache: > In menu, ReSharper > Options >\nEnvironment > General > Clear Caches and disabling and re-enabling ReSharper:\n> In menu, Tools > Options > ReSharper > General > Suspend / Restore did the\ntrick for me. I am not sure if both operations are necessary, but they solved\nmy problem.\n\n", "question_id": 17703004}, {"question_score": 40, "title": "Resharper 8 - Quickfix shortcut Alt+Enter gone", "answer_score": 98, "question_body": "<p>In Visual Studio 2012/2013, I want to reassign the Alt+Enter key combination to the \"Quickfix\" (triggering the menu from the light bulb) because it is not working anymore. I can't. I have tried the following (I am aware that some of the suggestions refer to VS 2010 and older R# versions):</p>\n\n<ul>\n<li>Tried to change manually in <code>Tools</code> - <code>Options</code> - <code>Keyboard</code>: the former ReSharper_QuickFix entry is gone, see <a href=\"http://i.stack.imgur.com/AjVqa.png\">ReSharper_QuickFix gone</a></li>\n<li>Tried Resharper_AltEnter as suggested in <a href=\"http://stackoverflow.com/questions/17227312/what-is-the-name-of-the-resharpers-quick-fix-command\">What is the name of the ReSharper&#39;s Quick Fix command</a> - nothing, no shortcut</li>\n<li>Switched back and forth settings in <code>ReSharper</code> -> <code>Options</code> -> <code>Keyboard &amp; Menus</code> as described in <a href=\"http://stackoverflow.com/questions/1596328/resharper-alt-enter-not-working\">Resharper Alt Enter not working</a> - nothing</li>\n<li>Switched back and forth settings in <code>ReSharper</code> -> <code>Options</code> -> <code>IntelliSense</code> -> <code>General</code> as also described in <a href=\"http://stackoverflow.com/questions/1596328/resharper-alt-enter-not-working\">Resharper Alt Enter not working</a> to no avail</li>\n<li>Tried other suggestions from the same page</li>\n<li>Sledgehammer approach: run devenv.exe /ResetSettings - nope</li>\n<li>Search SO and the web up and down - found nothing</li>\n</ul>\n\n<p>I have not yet had the nerve to re-install R# or even VS. </p>\n\n<p><strong>How can I get a standard set of R# keyboard shortcuts into Visual Studio?</strong> I'd gladly wipe out everything that is there just to get back my Alt+Enter Quickfix..</p>\n", "answer": "Please try this: * remove all mapping for Alt+Enter shortcut here Tools |\nOptions | Environment | Keyboard (to find out mapped actions, press Alt+Enter\nin \"Press shortcut keys\" field and look at the list in \"Shortcut currently\nused by\" dropdown); After removing: * Type ReSharper_AltEnter in \"Show command\ncontaining\" field; * Select \"Text Editor\" in \"Use new shortcut in\" dropdown; *\nPress Alt+Enter in \"Press shortcut keys\" field | Assign; * Select \"XAML UI\nDesigner\" in \"Use new shortcut in\" dropdown; * Press Alt+Enter in \"Press\nshortcut keys\" field | Assign;\n\n", "question_id": 18514642}, {"question_score": 66, "title": "Disabling Warnings generated via _CRT_SECURE_NO_DEPRECATE", "answer_score": 96, "question_body": "<p>What is the best way to disable the warnings generated via <code>_CRT_SECURE_NO_DEPRECATE</code> that allows them to be reinstated with ease and will work across Visual Studio versions?</p>\n", "answer": "If you don't want to pollute your source code (after all this warning presents\nonly with Microsoft compiler), add _CRT_SECURE_NO_WARNINGS symbol to your\nproject settings via \"Project\"->\"Properties\"->\"Configuration\nproperties\"->\"C/C++\"->\"Preprocessor\"->\"Preprocessor definitions\". Also you can\ndefine it just before you include a header file which generates this warning.\nYou should add something like this #ifdef _MSC_VER #define\n_CRT_SECURE_NO_WARNINGS #endif And just a small remark, make sure you\nunderstand what this warning stands for, and maybe, if you don't intend to use\nother compilers than MSVC, consider using safer version of functions i.e.\nstrcpy_s instead of strcpy.\n\n", "question_id": 119578}, {"question_score": 69, "title": "Why is Visual C++ lacking refactor functionality?", "answer_score": 67, "question_body": "<p>When programming in C++ in Visual Studio 2008, why is there no functionality like that seen in the refactor menu when using C#?</p>\n\n<p>I use <strong>Rename</strong> constantly and you really miss it when it's not there. I'm sure you can get plugins that offer this, but why isn't it integrated in to the IDE when using C++? Is this due to some gotcha in the way that C++ must be parsed?</p>\n", "answer": "The syntax and semantics of C++ make it **incredibly difficult** to correctly\nimplement refactoring functionality. It's possible to implement something\nrelatively simple to cover 90% of the cases, but in the remaining 10% of cases\nthat simple solution will horribly break your code by changing things you\nnever wanted to change. Read http://yosefk.com/c++fqa/defective.html#defect-8\nfor a brief discussion of the difficulties that any refactoring code in C++\nhas to deal with. Microsoft has evidently decided to punt on this particular\nfeature for C++, leaving it up to third-party developers to do what they can.\n\n", "question_id": 363292}, {"question_score": 79, "title": "HTTPS with Visual Studio's built-in ASP.NET Development Server", "answer_score": 102, "question_body": "<p>Is there a way to access Visual Studio's built-in ASP.NET Development Server over HTTPS?</p>\n", "answer": "As of now we can use IIS Express to develope and test in SSL. Here is a\ncomplete article explaning how to use IIS Express and Visual Studion 2010 to\ndevelope websites in SSL ![enter image description\nhere](http://i.stack.imgur.com/jvqeG.png) **Next** ![enter image description\nhere](http://i.stack.imgur.com/3didG.png) **Then you will get this** ![enter\nimage description here](http://i.stack.imgur.com/Oh154.png) Working with SSL\nat Development Time is easier with IISExpress Introducing IIS Express\n\n", "question_id": 60113}, {"question_score": 151, "title": "Shortcut to create properties in Visual Studio?", "answer_score": 318, "question_body": "<p>I have seen some people creating properties in C# really fast, but how they dod it?</p>\n\n<p>What shortcuts are available in Visual Studio (currently using Visual&nbsp;Studio&nbsp;2010) to create properties?</p>\n\n<p>I am using C#.</p>\n\n<p>For example,</p>\n\n<pre><code>public string myString {get;set;}\n</code></pre>\n", "answer": "You could type \"prop\" and then press tab twice. That will generate the\nfollowing. public TYPE Type { get; set; } Then you change \"TYPE\" and \"Type\":\npublic string myString {get; set;} You can also get the full property typing\n\"propfull\" and then tab twice. That would generate the field and the full\nproperty. private int myVar; public int MyProperty { get { return myVar;} set\n{ myVar = value;} }\n\n", "question_id": 3871270}, {"question_score": 1277, "title": "Using Git with Visual Studio", "answer_score": 993, "question_body": "<p>As a long-time <a href=\"http://en.wikipedia.org/wiki/Microsoft_Visual_SourceSafe\">Visual SourceSafe</a> user (and hater) I was discussing switching to <a href=\"http://en.wikipedia.org/wiki/Apache_Subversion\">SVN</a> with a colleague; he suggested using <a href=\"http://en.wikipedia.org/wiki/Git_%28software%29\">Git</a> instead. Since, apparently, it can be used as peer-to-peer without a central server (we just have a 3-developer team). </p>\n\n<p>I have not been able to find anything about tools that integrate Git with Visual Studio, though - does such a thing exist? </p>\n\n<p>What technologies are available for using Git with Visual Studio? And what do I need to know about how they differ before I begin?</p>\n", "answer": "In Jan 2013, Microsoft announced that they are adding full Git support into\nall their ALM products. They have published a plugin for Visual Studio 2012\nthat adds Git source control integration. Alternatively, there is a project\ncalled Git Extensions that includes add-ins for Visual Studio 2005, 2008, 2010\nand 2012, as well as Windows Explorer integration. It's regularly updated and\nhaving used it on a couple of projects, I've found it very useful. Another\noption is Git Source Control Provider.\n\n", "question_id": 507343}, {"question_score": 108, "title": "Is there a way to navigate to real implementation of method behind an interface?", "answer_score": 142, "question_body": "<p>In Visual Studio, when you right-click a method call, you go to the implementation of that method inside a class except if you access this method through an interface: in that case you go to the interface method not to the actual implementation.</p>\n\n<p>Is there a way / tips (key shortcut or anything) to access this actual implementation ? Otherwise you are stuck to add some comment just to remember where you did implement it that's really not productive and error prone !</p>\n\n<p>Update: interesting answers but I'm not really satisfied because all are cumbersome. I will give a precise example:</p>\n\n<pre><code>IInterface iInterface = someObject;                        \niInterface.someMethod();\n</code></pre>\n\n<p>Actually if Visual Studio was just a little bit clever to look just one line above the method call it would see where's the real object is. And that would save me a lot of keystrokes and avoid to use \"find all references\" and then scan the lines with my tired eyes to see which line contain the right one :)</p>\n", "answer": "I do the following: 1) Right click on the method and click \"View call\nhierarchy\" (or shortcut Ctrl+K, Ctrl+T) 2) Expand the \"Implements x\" folder\nwhich will then show you all the implementations of that method. Click on one\nto go there. Relatively quick and easy. Annoyingly though there doesn't seem\nto be an equivalent for the interface itself. * * * **update**: as of Visual\nStudio 2015 update 1, right click on a method and select go to implementation.\nYou can also map it to keyboard shortcut via Tools > Options > Environment >\nKeyboard and search for Edit.GoToImplementation command. The default shortcut\nis Ctrl+F12. (F12 will navigate to the interface). * * *\n\n", "question_id": 4662784}, {"question_score": 99, "title": "How can I turn off Visual Studio 2013 Preview?", "answer_score": 179, "question_body": "<p>When I want to search files I use <kbd>Ctrl</kbd>+<kbd>,</kbd>. The search box pops up and then I start typing. But the built-in preview just grabs whatever I have typed and opens the file. Even though I am still typing. </p>\n\n<p>I am trying to open a file called <code>report_vaccine</code>, but I only get as far as <code>report</code> when the preview opens the first selected report. This has rendered this form of quick file searching pretty much useless, which is frustrating because we have hundreds of procs, and scrolling through and manually finding the file is a huge pain. </p>\n\n<p>If there is a way to turn off preview, I would be fine with that. This command working properly is waaay more important to me than a preview of the file to be opened.</p>\n\n<p>I don't have resharper. I think the command was like <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>t</kbd>.  </p>\n", "answer": "From the menu go to Tools -> Options then navigate to Environment -> Tabs and\nWindows and uncheck the Preview Tab checkboxes.\n\n", "question_id": 19913313}, {"question_score": 89, "title": "How to Enable WiX Projects in Visual Studio 2015", "answer_score": 127, "question_body": "<p>When I go the the New Project dialog in Visual Studio 2015, Windows Installer XML isn't available. How can I enable WiX projects in Visual Studio 2015?</p>\n", "answer": "**Update 2015-09-08:** WiX Toolset 3.10 is released with official support for Visual Studio 2015 editions. It is available for download from wixtoolset.org. You can manually enable Visual Studio 2015 compatibility with WiX 3.9 or earlier: 1\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\. Copy C:\\Program Files (x86)\\Microsoft Visual Studio 12.0\\Common7\\IDE\\Extensions\\Microsoft\\WiX to C:\\Program Files (x86)\\Microsoft Visual Studio 14.0\\Common7\\IDE\\Extensions\\Microsoft\\WiX 2\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\. Then execute as Administrator: > \"C:\\Program Files (x86)\\Microsoft Visual Studio 14.0\\Common7\\IDE\\devenv\" /setup ![enter image description here](http://i.stack.imgur.com/vGzIA.png) When you open Visual Studio 2015, WiX 3.9 and earlier projects will be compatible. ![enter image description here](http://i.stack.imgur.com/oGZEC.png) \n\n", "question_id": 26110643}, {"question_score": 54, "title": "Visual Studio window which shows list of methods", "answer_score": 49, "question_body": "<p>In Visual Studio, is there a window which shows list of methods in the active class? A small window like the Solution Explorer would be great. In Eclipse, there is one.</p>\n", "answer": "There's a drop down just above the code window: ![alt\ntext](http://i.stack.imgur.com/N1Shu.png) It's called **Navigation bar** and\ncontains three drop downs: first drop down contains _project_, second _type_\nand **third _members_** (methods). You can use the shortcut Ctrl\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\+ F2 (move focus to the _project_ drop down) and press Tab twice\n(move focus to the third drop down) to focus it, down arrow will expand the\nlist. Full size image\n\n", "question_id": 2819519}, {"question_score": 70, "title": "Can't change target platform to \"any CPU\"", "answer_score": 114, "question_body": "<p>I work on an x86 pc and use .NET4.0 (same probelem with 3.5) in VS2010. When I make a new Project (e.g. WinFormsApp), the first thing I want to do is to change the target platform of the project/solution to \"Any CPU\".</p>\n\n<p>I do the following:</p>\n\n<blockquote>\n  <p>Project Properties -> build -> change TargetPlatform to \"Any CPU\"</p>\n</blockquote>\n\n<p>On top of the properties page the platform is still \"Active (x86)\", so I do</p>\n\n<blockquote>\n  <p>Solution Properties -> ConfigurationsMgr -> Platform -> new (since nothing but x86 is available) and create the solution platform \"Any CPU\".</p>\n</blockquote>\n\n<p>Now the project properties are \"Active (Any CPU)\" and I can change it back and forth as I like.</p>\n\n<p>And now the Problem: When I add a new Project, it is again set to \"Active (x86)\" and I -again - can't change the project settings. In the SolutionProperties -> ConfigurationManager for this second project, the \"Any CPU\" platform is not available and I can't add a new one, since it tells me that a solution platform for AnyCPU is already there...</p>\n\n<p>What am I doing wrong? Can it be so hard to set a newly created project to AnyCPU?</p>\n", "answer": "In the configuration Manager, you can add a new platform for your project.\nHowever, you need to uncheck the \"Create new solution platforms\" if you\nalready added the platform for your solution, otherwise you will indeed get\nthe warning that the solution platform is already there.\n\n", "question_id": 4012732}, {"question_score": 46, "title": "Visual Studio 2015 project builds failed but no errors", "answer_score": 36, "question_body": "<p>My project builds all fail but I'm not shown any errors. I tried cleaning and rebuilding, that didn't work. </p>\n\n<p>I changed the MSBuild output verbosity to 'Diagnostic' hoping it would help me identify the problem and now I'm stuck. Here's what the output looks like:</p>\n\n<pre><code>1&gt;Project 'ProjectMM.Data.Models' is not up to date. Input file 'C:\\Projects\\ProjectMM\\ProjectMM.Data.Models\\ProjectMM.Data.Models.csproj' is modified after output file 'C:\\Projects\\ProjectMM\\ProjectMM.Data.Models\\bin\\Debug\\ProjectMM.Data.Models.pdb'.\nAll packages are already installed and there is nothing to restore.\n1&gt;------ Build started: Project: ProjectMM.Data.Models, Configuration: Debug Any CPU ------\n2&gt;Project 'ProjectMM.Data' is not up to date. Input file 'C:\\Projects\\ProjectMM\\ProjectMM.Data\\ProjectMM.Data.csproj' is modified after output file 'C:\\Projects\\ProjectMM\\ProjectMM.Data\\bin\\Debug\\ProjectMM.Data.pdb'.\n2&gt;------ Build started: Project: ProjectMM.Data, Configuration: Debug Any CPU ------\n3&gt;Project 'ProjectMM' is not up to date. Input file 'c:\\projects\\projectmm\\projectmm\\app_start\\bundleconfig.cs' is modified after output file 'C:\\Projects\\ProjectMM\\ProjectMM\\bin\\ProjectMM.pdb'.\n3&gt;------ Build started: Project: ProjectMM, Configuration: Debug Any CPU ------\n========== Build: 0 succeeded, 3 failed, 0 up-to-date, 0 skipped ==========\n</code></pre>\n", "answer": "I have had the same problem and closing and re-opening Visual Studio clears it\nup. I had also tried Cleaning the solution and the Clean Failed as well. There\nmay be other scenarios where this does not do the trick, but in my case\nrestarting has resolved this for me.\n\n", "question_id": 31911433}, {"question_score": 213, "title": "visual studio 2012 / 2013 single click opens file", "answer_score": 396, "question_body": "<p>In my Visual Studio 2012 solution explorer, when I single click a filename it opens it.  This was different from VS2010 (required a double click).  Is there a way to make double-click the 'view file' command?</p>\n", "answer": "This is where you change that behavior (in VS2012, VS 2013 and VS 2015):\n![enter image description here](http://i.stack.imgur.com/iboRQ.jpg)\n\n", "question_id": 12534694}, {"question_score": 45, "title": "How do you clear your Visual Studio cache on Windows Vista?", "answer_score": 64, "question_body": "<p>I have a problem where my ASP.NET controls are not able to be referenced from the code behind files. </p>\n\n<p>I found a solution in Stack&nbsp;Overflow question <a href=\"http://stackoverflow.com/questions/38670/asp-net-controls-cannot-be-referenced-in-code-behind-in-visual-studio-2008\">ASP.NET controls cannot be referenced in code-behind in Visual Studio 2008</a>.</p>\n\n<p>But I cannot seem to find my Visual Studio cache to clear it. I am using Visual Studio 2005 on Windows Vista.</p>\n", "answer": "The accepted answer gave two locations: > here > > C:\\Documents and\nSettings\\Administrator\\Local Settings\\Temp\\VWDWebCache > > and possibly here >\n> C:\\Documents and Settings\\Administrator\\Local Settings\\Application\nData\\Microsoft\\WebsiteCache Did you try those? **Edited to add** On my Windows\nVista machine, it's located in %Temp%\\VWDWebCache and in\n%LocalAppData%\\Microsoft\\WebsiteCache From your additional information\n(regarding team edition) this comes from Clear Client TFS Cache: > Clear\nClient TFS Cache > > Visual Studio and Team Explorer provide a caching\nmechanism which can get out of sync. If I have multiple instances of a single\nTFS which can be connected to from a single Visual Studio client, that client\ncan become confused. > > To solve it.. > > For Windows Vista delete contents\nof this folder > > %LocalAppData%\\Microsoft\\Team Foundation\\1.0\\Cache\n\n", "question_id": 520593}, {"question_score": 107, "title": "See all breakpoints in Visual Studio 2010+", "answer_score": 193, "question_body": "<p>Is there a window in Visual Studio 2010 and newer where I can see all the breakpoints that I have in my project or solution?</p>\n", "answer": "Try **Debug** -> **Windows** -> **Breakpoints**.\n\n", "question_id": 7781977}, {"question_score": 37, "title": "Is there a way to zoom the Visual Studio text editor with a keyboard shortcut?", "answer_score": 52, "question_body": "<p>Yesterday I found myself needing to zoom my Visual Studio 2010 text editor and was without a mouse (don't ask). Typically I do this by holding down <kbd>CTRL</kbd> and scrolling the mouse wheel. I also couldn't figure out how to tab into the area where you can specify your zoom level in the lower left hand corner of the text editor window.</p>\n\n<p><img src=\"http://i.stack.imgur.com/IGNxV.png\" alt=\"zoom in the lower left corner of the text editor window\"></p>\n\n<p>So I guess I have two questions.</p>\n\n<ol>\n<li>Is there a menu setting somewhere that I could have navigated to via the keyboard to set my zoom level? </li>\n<li>Even better is there a similar mechanism to zoom like holding <kbd>CTRL</kbd> and scrolling the mouse wheel?</li>\n</ol>\n", "answer": "I don't know if there is a menu option, but there are keyboard shortcuts to\nset the zoom level. ctrl+shift+. to Zoom In ctrl+shift+, to Zoom Out\n\n", "question_id": 3096600}, {"question_score": 115, "title": "Visual Studio 2012 - Intellisense sometimes disappearing / broken", "answer_score": 160, "question_body": "<p>My colleagues and I are using VS2012 for some weeks now. Sometimes after working several hours the intellisense is broken. After closing all open tabs it works again.</p>\n\n<p>Are there more people out there having the same problem? It can't be an extension problem because I have the same problem at home. Maybe there is a workaround for this?</p>\n", "answer": "<p>These are the few top solutions for getting Visual Studio 2012 intellisense back on track try them one by one, hope one of them will solve the problem:</p>\n\n<p><code>When the problem occurs next time follow these:</code>\n<em>start from #1 and Move to next when the earlier one doesn't work for you</em></p>\n\n<p>1: <code>Close all the tabs</code> and open your file again. <em>(Thanks to russds)</em></p>\n\n<p>2: <code>Clean the Build</code> > <code>Close the Solution</code> > <code>Restart Visual Studio</code> > <code>Open the Solution</code> again</p>\n\n<p>3: Goto:  <code>Edit</code> > <code>IntelliSense</code> > <code>Refresh Local Cache</code></p>\n\n<p>4:  Close Visual Studio 2012 and delete this folder: <code>%AppData%\\Microsoft\\VisualStudio\\11.0\\ReflectedSchemas</code></p>\n\n<p>5: Goto: <code>TOOLS</code> > <code>Import and Export Settings</code> > <code>Reset all settings</code></p>\n\n<p>6: Delete <code>.suo</code> file in the project folder. <em>(Thanks to Jason Steele)</em></p>\n\n<p>I am hopeful your problem will get solved by any of the above six steps.\nBut if it doesn’t after all this than I think you should consider reinstalling your VS2012.</p>\n", "question_id": 13375961}, {"question_score": 207, "title": "Running two projects at once in Visual Studio", "answer_score": 359, "question_body": "<p>I created a solution in Visual C# 2010 Express that contains two projects: one is the client, the other is the server. I would like to debug both at the same time, but I can only seem to run one of the projects during debugging.</p>\n\n<p>Is there a way to run both at once?</p>\n", "answer": "Go to Solution properties -> Common properties -> Startup Project and select\nMultiple startup projects\n\n", "question_id": 3850019}, {"question_score": 184, "title": "How to Turn Off Showing Whitespace Characters in Visual Studio IDE", "answer_score": 352, "question_body": "<p>I don't know what I did but I don't know how to get rid of those arrows on the left.</p>\n\n<p><img src=\"http://i.stack.imgur.com/xBwEu.jpg\" alt=\"alt text\"></p>\n", "answer": "CTRL-R, CTRL-W : Toggle showing whitespace or under the Edit Menu: * Edit ->\nAdvanced -> View White Space [BTW, it also appears you are using Tabs. It's\ncommon practice to have the IDE turn Tabs into spaces (often 4), via Options.]\n\n", "question_id": 4065815}, {"question_score": 46, "title": "How do you default a new class to public when creating it in Visual Studio?", "answer_score": 40, "question_body": "<p>When I right click in the Solution of a C# Visual Studio project and select Add... > Class... it creates a class without a public modifier. How do I get Visual Studio (2008) to default the class to a public class?</p>\n", "answer": "You need to modify the file located in C:\\Program Files\\Microsoft Visual\nStudio 9.0\\Common7\\IDE\\ItemTemplates\\CSharp\\Code\\1033. **Visual Studio 2010\n(10.0) and below:** There is a zip file in there called Class.zip. Unpack\nthis, edit the file to put in your public keyword then re-pack it (make sure\nyou backup the original). After this, make sure VS rebuilds it's cache (which\nis just the zipfiles unzipped into directories in C:\\Program Files\\Microsoft\nVisual Studio 9.0\\Common7\\IDE\\ItemTemplatesCache) by opening a Visual Studio\ncommand shell and execute the following command: devenv /installvstemplates\n**Visual Studio 2012 (11.0) and up:** See the answer by @JochemKempe, as it's\nmuch easier to change this now, just by editing a single file (no unzipping or\nrezipping). **UPDATE:** Don't forget to open your preferred text editor with\nadmin privileges before you do any edit.\n\n", "question_id": 700086}, {"question_score": 368, "title": "How do you auto format code in visual studio?", "answer_score": 597, "question_body": "<p>I know Visual Studio can auto format to make my methods and loops indented properly, but I cannot find the setting.</p>\n", "answer": "To format a selection: Ctrl+K, Ctrl+F To format a document: Ctrl+K, Ctrl+D See\nthe pre-defined keyboard shortcuts. (These two are Edit.FormatSelection and\nEdit.FormatDocument.)\n\n", "question_id": 5755942}, {"question_score": 112, "title": "Visual Studio: How to show Overloads in IntelliSense?", "answer_score": 151, "question_body": "<p>Once code has been written, the only way I know of to view the overloads for a method is to actually edit the method by deleting the Parenthesis <code>()</code> and reopening them.</p>\n\n<p>Is there a shortcut key that I could press to activate this instead of having to edit my files?</p>\n\n<p>For an example, please reference the <strong>ShowDialog Overload</strong> screen shot below:</p>\n\n<p><img src=\"http://i.stack.imgur.com/RZ9HI.png\" alt=\"ShowDialog1 Overloads\"></p>\n", "answer": "Try the keyboard shortcut Ctrl-Shift-Space. This corresponds to\nEdit.ParameterInfo, in case you've changed the default.\n\n", "question_id": 9891656}, {"question_score": 200, "title": "How to add MVC5 to Visual Studio 2013?", "answer_score": 267, "question_body": "<p>I'm starting a new project, and would like to give a try to MVC 5 (I have built a web app using MVC 4 before).</p>\n\n<p>In Visual Studio 2013, I click the New Project and navigate to Visual C# > Web > Visual Studio 2012 (even though I have installed VS 2013 it says 2012 in the menu) and on that list I only have MVC 4 application - not 5.</p>\n\n<p>The framework in the drop down menu is set to .NET Framework 4.5.1 - and still nothing.</p>\n\n<p>I've checked Tools > Extensions and Update and searched for MVC 5 - but it doesn't find anything official from Microsoft.</p>\n\n<p>How can I add MVC 5 to my Visual Studio 2013?</p>\n\n<p>Thank you</p>\n", "answer": "Visual Studio 2013 no longer has separate project types for different ASP.Net\nfeatures. You must select .NET Framework 4.5 (or higher) in order to see the\nASP.NET Web Application template (For ASP.NET One). So just select Visual C# >\nWeb > ASP.NET Web Application, then select the MVC checkbox in the next step.\n_Note: Make sure not to select the C# > Web > **Visual Studio 2012** sub\nfolder._\n\n", "question_id": 21096746}, {"question_score": 66, "title": "Visual Studio: How do I show all classes inherited from a base class?", "answer_score": 37, "question_body": "<p>In Visual Studio, How do I show all classes inherited from a base class?  </p>\n\n<p><strong>For example</strong>, in ASP.NET MVC there are several '<a href=\"http://msdn.microsoft.com/en-us/library/system.web.mvc.actionresult.aspx\">ActionResult</a>' types -- and they all inherit from / implement the base class <code>ActionResult</code>.  </p>\n\n<p>It looks like unless you just 'know' that <code>View</code> and <code>Json</code> are valid <code>ActionResult</code> types, there is no way you can easily find this information out.  </p>\n\n<p><em>Please prove me wrong.</em></p>\n\n<p>Is there something in the object browser that makes this easy to find out?</p>\n\n<p>I'm even up for suggestions of tools outside of Visual Studio to discover this information about various classes.  For example: is there something in Resharper that will help me out?</p>\n", "answer": "Sure, Resharper can do this. And much more. Just right click on type name in\nany place and choose \"Go To Inheritor\" in context menu. \"Go To Inheritor\" can\nbe also applied to method for navigating to overrides and an interface\nmethod's implementations. For an interface you could call \"Find Usages\nAdvanced\" againd, just right click) where to find all extendings and\nimplementations. For a type - derived types. And my favorite feature - click\nwith holding Control on any type/method for navigating to its declaration. I\nthink it's a must-have tool for .net developers.\n\n", "question_id": 282377}, {"question_score": 30, "title": "Visual Studio IDE: I want it to make a sound after it compiles so I can get back to work", "answer_score": 65, "question_body": "<p>Would be a nice thing - do I have to write a script or can't I just tweak the build script to do some task?</p>\n", "answer": "Windows already has support for this, go to the Control Panel and open up\nSounds and Audio Devices. Under the Sounds tab there is a section for program\nevents. If you scroll down far enough one of the sections will be Microsoft\nVisual Studio. Then just pick the sound you want to hear for Build Succeeded\nand Build Failed. You will need to restart Visual Studio after choosing your\nsounds.\n\n", "question_id": 2836947}, {"question_score": 60, "title": "How to use a Class from one C# project with another C# project", "answer_score": 39, "question_body": "<p>In the same solution, i have two projects P1 and P2. how can i make use of a class of P1 in P2 ?</p>\n", "answer": "Simply add reference to P1 from P2\n\n", "question_id": 3554658}, {"question_score": 315, "title": "Visual Studio Debugging/Loading Very Slow", "answer_score": 443, "question_body": "Body too long: deleted.", "answer": "Here is how I solved the \"slow symbol loading\" problem in Visual Studio 2012:\n* Go to Tools -> Options -> Debugging -> General * CHECK the checkmark next to\n\"Enable Just My Code\". * Go to Tools -> Options -> Debugging -> Symbols *\nClick on the \"...\" button and create/select a new folder somewhere on your\nlocal computer to store cached symbols. I named mine \"Symbol caching\" and put\nit in Documents -> Visual Studio 2012. * Click on \"Load all symbols\" and wait\nfor the symbols to be downloaded from Microsoft's servers, which may take a\nwhile. **Note that Load all symbols button is only available while\ndebugging.** * UNCHECK the checkmark next to \"Microsoft Symbol Servers\" to\nprevent Visual Studio from remotely querying the Microsoft servers. * Click\n\"OK\". From now on, symbol loading should be much faster. Note that if you make\nany changes/downloads to Microsoft assemblies, you may need to go back into\nthe Symbols dialog box and \"Load all symbols\" again.\n\n", "question_id": 12567984}, {"question_score": 76, "title": "Code-snippet or short cut to create a constructor in Visual Studio", "answer_score": 160, "question_body": "<p>What is the code-snippet or short cut to create a constructor in Visual Studio?</p>\n\n<p>Visual Studio 2010 and C#.</p>\n\n<p>I've used before but I can't remember.</p>\n", "answer": "Type \"ctor\" and hit TAB, this will create the default constructor for the\nclass you are in public MyClass() { } On your previous question someone gave\nan answer where you can see all the code-snippets. **UPDATE** It seems that in\nsome cases you will have to press TAB twice. Thanks @ho1.\n\n", "question_id": 3873702}, {"question_score": 59, "title": "How can I make Visual Studio wrap lines at 80 characters?", "answer_score": 39, "question_body": "<p>Is there any way to make Visual Studio word-wrap at 80 characters?  I'm using VS2008.</p>\n\n<p><a href=\"http://stackoverflow.com/questions/84209/vertical-line-after-a-certain-amount-characters-in-visual-studio\">This post is loosely related.</a></p>\n", "answer": "Tools >> Options >> Text Editor >> All Languages >> General >> Select Word\nWrap. I dont know if you can select a specific number of columns?\n\n", "question_id": 236517}, {"question_score": 31, "title": "How do I install the Visual Web Developer feature for Visual Studio 2010", "answer_score": 34, "question_body": "<p>I have Visual Studio 2010 Premium installed, and I want to install the Silverlight 4 SDK.</p>\n\n<p>The SDK says that it requires the Visual Web Developer feature for Visual Studio 2010.  Any idea as to how to install, or activate this feature?</p>\n\n<hr>\n\n<p><img src=\"http://i.stack.imgur.com/orCLl.png\" alt=\"enter image description here\"></p>\n", "answer": "Run the Visual Studio installer and double check the installed components.\nMake sure Web Developer is enabled (Web Developer should be part of the\nstandard installation for VS 2010 Premium) and then hit OK. Once the\ninstallation has completed try installing the Silverlight SDK again.\n\n", "question_id": 4669704}, {"question_score": 61, "title": "What should be contained in a global source code control ignore pattern for Visual Studio 2010?", "answer_score": 72, "question_body": "<p>After installing and using Visual Studio 2010, I'm seeing some newer file types (at least with C++ projects ... don't know about the other types) as compared to 2008.  e.g. .sdf, .opensdf, which I guess are the replacement for ncb files with Intellisense info stored in SQL Server Compact files?  I also notice .log files are generated, which appear to be build logs.</p>\n\n<p>Given this, what's safe to add to my global ignore pattern?  Off the bat, I'd assume .sdf, .opensdf, but what else?</p>\n", "answer": "For C++ projects, you should be fine ignoring the following files: * *.sdf and\n*.opensdf (temporary file opened only while .vcxproj/.sln is loaded to Visual\nStudio IDE) * *.suo * *.vcxproj.user * ipch folder, if your project uses Pre-\ncompiled Headers (PCH); it is a storage for Intellisense compiler which can\nnow utilise PCH for better performance For C# projects, it's also a good idea\nto ignore bin and obj directories, and *.suo too.\n\n", "question_id": 2538149}, {"question_score": 26, "title": "How to make Visual Studio not put { on a new line?", "answer_score": 41, "question_body": "<p>If I have code like this</p>\n\n<pre><code>if(true){\n</code></pre>\n\n<p>and I add</p>\n\n<pre><code>}\n</code></pre>\n\n<p>it is transformed into</p>\n\n<pre><code>if (true)\n{\n}\n</code></pre>\n\n<p>but I would like it to stay in format</p>\n\n<pre><code>if (true) {\n}\n</code></pre>\n\n<p>Even if I copy code that has <code>if</code> like this, it is transformed into the longer version.</p>\n\n<p>P.S. I understand that it's a C++ and C# standard to use the longer version, however I do come from a different standard, and it's easier for me to use the shorter version.</p>\n\n<p><strong>I bet there is some formatter option that can be turned off or changed.</strong></p>\n", "answer": "Go to Tools->Options->Text Editor->C#->Formatting->New Lines Here there are a\nlot of options. Remove the check on **all** options here to never put the open\nbracket on a new line. **EDIT** The section New Line Options for expressions\ndoes not relate to placement of code in conjunction with brackets, so those\nyou don't need to touch.\n\n", "question_id": 4860933}, {"question_score": 35, "title": "Error \"A namespace does not directly contain members such as fields or methods\"", "answer_score": 53, "question_body": "<p>I'm trying to build my C# project and I'm getting the error message \"A namespace does not directly contain members such as fields or methods\".  It is flagging the first character (the less than symbol) of the app.config file.</p>\n\n<p>I've checked all of my files for places where there are variables or functions directly inside of a namespace--found nothing.  The app.config looks fine.</p>\n\n<p>Google is failing me and I'm pulling my hair out.  What could be causing this error?</p>\n", "answer": "Figures! As soon as I finally break down and ask the question that I find the\nanswer... The app.config file properties section (somehow) listed the Build\nAction of \"Compile\" when it should be set to \"None\". How in the world did it\nget changed? I know I didn't change it. Grrr... Oh well, at least it's\nbuilding now. Hopefully someone else will benefit from my hairloss.\n\n", "question_id": 2090369}, {"question_score": 26, "title": "Formatting - at once - all the files in a Visual Studio project", "answer_score": 20, "question_body": "<p>I am interested in formatting all the files in a Visual Studio (ver. 2005)  project all at once.</p>\n\n<p>Currently, there is a way to format a single document by doing something like <strong>Edit->Advanced->Format Document</strong>. However, I don't see a single command to format all the files of a project all at once.</p>\n\n<p>Any idea how to do that?</p>\n", "answer": "Tim Abell wrote a macro to do this on his blog: > Here's a handy macro script\nfor visual studio I knocked together today. It runs \"edit, format document\" on\nevery document of the listed file types. > > You have to keep an eye on it as\nit's interactive and does sometimes pop up a message and wait for an answer. >\n> You can get the vb file at http://github.com/timabell/vs-formatter-macro\nMore info at http://wiki.github.com/timabell/vs-formatter-macro The original\ncode is available at the blog post. Note that this is older than the version\navailable on github above.\n\n", "question_id": 931406}, {"question_score": 67, "title": "Include only certain file types when searching in Visual Studio", "answer_score": 52, "question_body": "<p>Often when I want to search through my code in Visual Studio, I know the thing I'm looking for is in some C# code. However, as I've used the same variable name in a JavaScript file, I have to wade through all those search results too. This gets even worse when the text I'm looking for is also used in a third-party JavaScript library that we've brought into the project: this can result in hundreds of search results.</p>\n\n<p>To compound things, our designers include HTML mock-ups of the pages in the same project, so I often find I'm hitting loads of search results in there too.</p>\n\n<p>I guess what I really want is to see results in my .cs, .aspx, and .ascx files, but not .js or .htm.</p>\n\n<p>Is there any way to do any of the following:</p>\n\n<ul>\n<li>Search only in files of a particular type (search only .cs files).</li>\n<li>Search only in files of any of a given set of types (search only .cs, .aspx and .ascx files).</li>\n<li>Search in all file types except a particular type or types (search everything except .js).</li>\n</ul>\n\n<p>I suspect not, in which case is there any crafty way of working around this?</p>\n", "answer": "In the Find in Files dialog, there should be a field called Find Options. You\nshould be able to enter the extensions of fields you want to search in a field\nin this dialog: *.cs; *.aspx; *.ascx;\n\n", "question_id": 1749837}, {"question_score": 391, "title": "How do I add an existing directory tree to a project in Visual Studio?", "answer_score": 651, "question_body": "<p>The issue is simple really. Instead of creating folders in Visual Studio, I create a directory structure for my project on the file system. How do I include all the folders and files in a project, keeping the structure?</p>\n\n<p>If I \"Add Existing File\" on a folder named Services and navigate to a file in the directory structure .. Services > AccountManagement > CreateAccount.cs, it appears in Visual Studio like so: Services > CreateAccount.cs. I do not want this.</p>\n\n<p>I have an entire directory structure worked out already, as I am mimicking our client developers using the same structure for organization. How do I add all the folders and files to the project in Visual Studio? Or do I have to do what most Microsoft users do and \"put up with it\" and recreate each and every folder through Visual Studio?</p>\n", "answer": "You need to put your directory structure in your project directory. And then\nclick \"Show All Files\" icon in the top of Solution Explorer toolbox. After\nthat, the added directory will be shown up. You will then need to select this\ndirectory, right click, and choose \"Include in Project.\" ![enter image\ndescription here](http://i.stack.imgur.com/ub2DI.png) ![enter image\ndescription here](http://i.stack.imgur.com/oIDP1.png)\n\n", "question_id": 392473}, {"question_score": 75, "title": "Make Visual Studio understand CamelCase when hitting ctrl and cursor keys", "answer_score": 96, "question_body": "<p><strong>Is there a way that I can configure Visual Studio 2008 to understand CamelCase?</strong>  Specifically, I'd like to be able to get <code>ctrl + right</code> or <code>left</code> cursor to take me to a subsection of a variable or type name.</p>\n\n<p>i.e., if my cursor was at the start of this line:</p>\n\n<pre><code>LongNamedExampleClass longNamed = new LongNamedExampleClass();\n</code></pre>\n\n<p>and I hit <code>ctrl + right</code>, I'd like to jump to \"<code>Named</code>\" in the class name, rather than the start of the variable name.  If I hit it again, I'd like to go to \"<code>Example</code>\".  I hope that makes sense...</p>\n\n<p>I used this navigational feature in eclipse quite a lot, and find it difficult to unlearn something so ingrained.</p>\n", "answer": "Thanks for those who suggested Resharper. Gives me another reason to love it\neven more. Just to be specific about where this lives - JetBrains call it\n**CamelHumps** (cute) and you can switch it on using the menu: > **Resharper\n-> Options -> Environment -> Editor -> Editor Behavior -> Use CamelHumps** ...\nin older versions of Resharper, it is; > **Resharper -> Options -> Editor ->\nUse CamelHumps**\n\n", "question_id": 314095}, {"question_score": 126, "title": "Break when a value changes using the Visual Studio debugger", "answer_score": 76, "question_body": "<p>Is there a way to place a watch on variable and only have Visual Studio break when that value changes?</p>\n\n<p>It would make it so much easier to find tricky state issues.</p>\n\n<p>Can this be done?</p>\n\n<p>Breakpoint conditions still need a breakpoint set, and I'd rather set a watch and let Visual Studio set the breakpoints at state changes.</p>\n", "answer": "In the Visual Studio 2005 menu: _Debug_ -> _New Breakpoint_ -> _New Data\nBreakpoint_ Enter: &myVariable;\n\n", "question_id": 160045}, {"question_score": 65, "title": "VB.NET IntelliSense : Disable newline on ENTER autocomplete", "answer_score": 39, "question_body": "<p>When editing C# code in Visual Studio 2010, the <kbd>ENTER</kbd> key makes IntelliSense complete the current suggestion, without adding a new line.</p>\n\n<p>In VB.NET, the default IntelliSense behavior for the <kbd>ENTER</kbd> key is to add a new line after completing the current suggestion.</p>\n\n<p>How can I configure IntelliSense to change the VB.NET behavior to the C# one?</p>\n\n<p>I already know that I could press <kbd>TAB</kbd> or <kbd>SPACE</kbd>, but out of habit I always end up hitting <kbd>ENTER</kbd> (and changing line).</p>\n", "answer": "Unfortunately the set of trigger keys for intellisense completion is not a\nconfigurable item for VB.Net. There is no way in the default Visual Studio\nenvironment to change this behavior. It would be possible to develop a plugin\nof sorts to accomplish this. However that's a pretty extreme measure.\n\n", "question_id": 8977333}, {"question_score": 272, "title": "Preventing console window from closing on Visual Studio C/C++ Console application", "answer_score": 275, "question_body": "<p>This is a probably an embarasing question as no doubt the answer is blindingly obvious.</p>\n\n<p>I've used Visual Studio for years, but this is the first time I've done any 'Console Application' development.</p>\n\n<p>When I run my application the console window pops up, the program output appears and then the window closes as the application exits.</p>\n\n<p>Is there a way to either keep it open until I have checked the output, or view the results after the window has closed?</p>\n", "answer": "If you run without debugging (Ctrl+F5) then by default it prompts your to\npress return to close the window. If you want to use the debugger, you should\nput a breakpoint on the last line.\n\n", "question_id": 1775865}, {"question_score": 114, "title": "How to locate a file in Solution Explorer in Visual Studio 2010?", "answer_score": 141, "question_body": "<p>I have a huge solution with multiple projects. Sometime I need to navigate to a file in <strong>Solution Explorer</strong>. Using the VS 2010 '<strong>Navigate To</strong>' feature I can open any file by name in Visual Studio 2010 but I want to be able to select the file in <strong>Solution Explorer</strong> as well?</p>\n", "answer": "There's an option to track the active (open and viewed) item in the solution\nexplorer. If the file is in view, the file in the solution explorer will be\nselected. Tools->Options->Projects and Solutions->Track Active Item in\nSolution Explorer\n\n", "question_id": 3436222}, {"question_score": 589, "title": "How to \"Add Existing Item\" an entire directory structure in Visual Studio?", "answer_score": 569, "question_body": "<p>I feel ridiculous for asking this because it seems like it should be so simple, however I have been unable to discover an answer to this question.</p>\n\n<p>I have a free standing set of files not affiliated with any C# project at all that reside in a complicated nested directory structure. I want to add them in that format to a different directory in an ASP.NET web application I am working on; while retaining the same structure. So, I copied the folder into the target location of my project and I tried to “add existing  item” only to lose the previous folder hierarchy. Usually I have re-created the directories by hand, copied across on a one-to-one basis, and then added existing items. There are simply too many directories/items in this case. </p>\n\n<p>So how do you add existing directories and files in Visual Studio 2008?</p>\n", "answer": "Drag the files / folders from Windows Explorer into the Solution Explorer. It\nwill add them all. Note this doesn't work if Visual Studio is in Administrator\nMode, because Windows Explorer is a User Mode process.\n\n", "question_id": 57776}, {"question_score": 113, "title": "What key shortcuts are to comment and uncomment code in Visual Studio 2012?", "answer_score": 131, "question_body": "<p>There were <kbd>Ctrl</kbd>+<kbd>E</kbd>+<kbd>C</kbd> (comment) and <kbd>Ctrl</kbd>+<kbd>E</kbd>+<kbd>U</kbd> (uncomment) in older versions, or <kbd>Ctrl</kbd>+<kbd>K</kbd>+<kbd>C</kbd>  and <kbd>Ctrl</kbd>+<kbd>K</kbd>+<kbd>U</kbd>. But in VS 2012 I can't see key shortcuts (look at screenshot) ... Maybe should I enable those shortcuts anywhere???\n<img src=\"http://i.stack.imgur.com/0E9m8.png\" alt=\"enter image description here\"></p>\n", "answer": "Keyboard accelerators are configurable. You can find out which keyboard\naccelerators are bound to a command in Tools -> Options on the Environment ->\nKeyboard page. These commands are named **Edit.CommentSelection** and\n**Edit.UncommentSelection**. (With my settings, these are bound to Ctrl+K,\nCtrl+C and Ctrl+K, Ctrl+U. I would guess that these are the defaults, at least\nin the C++ defaults, but I don't know for sure. The best way to find out is to\ncheck your settings.)\n\n", "question_id": 12066739}, {"question_score": 128, "title": "Visual Studio 2013 and BitBucket", "answer_score": 204, "question_body": "<p>Visual Studio 2013 apparently has some nice slick Git integration.</p>\n\n<p>However, after an hour of head-scratching with absolutely nothing making even the slightest bit of sense, I've only been able to create a local repository and despite cloning a remote bitbucket repository I simply cannot find a way to publish to my remote repository.</p>\n\n<p>I've used TFS, Subversion, Perforce and just about everything else, but this is completely baffling, with no instructions and a completely un-intuitive user interface.</p>\n\n<p>Any ideas anyone ?</p>\n", "answer": "John's statement that \"you need Team Foundation Server\" to work with BitBucket\nis not correct. I just published a project to BitBucket from Visual Studio\n2013 (preview version). Here's how. * Add solution to Source Control ![enter\nimage description here](http://i.stack.imgur.com/9II92.jpg) * Commit to local\nGit ![enter image description here](http://i.stack.imgur.com/X6wMu.jpg) * In\nthe \"Changes\" area, click \"Commits\". This takes you to the dialog where you\ncan publish to a Remote Repository. ![enter image description\nhere](http://i.stack.imgur.com/qjnSO.jpg) * Enter the URL to your BitBucket\nrepository (must already exist in BitBucket and must be empty) and click\n\"Publish\" ![enter image description here](http://i.stack.imgur.com/ca4My.jpg)\n* Enter your BitBucket credentials when prompted. After the publish finishes\nyou'll get a results message like this. ![enter image description\nhere](http://i.stack.imgur.com/vrfzn.jpg) * Use the \"Sync\" button to update\nBitBucket with your local commits ![enter image description\nhere](http://i.stack.imgur.com/lKk26.jpg)\n\n", "question_id": 18836351}, {"question_score": 649, "title": "Fixing \"The breakpoint will not currently be hit. No symbols have been loaded for this document.\"", "answer_score": 495, "question_body": "<p>C# desktop application on express edition. Worked then didn't work 5 seconds later.</p>\n\n<p>I tried the following.</p>\n\n<ul>\n<li>Ensure debug configuration, debug flag, and full debug info are set on all assemblies.</li>\n<li>Delete all bin and obj folders and all DLLs related to the project from my entire machine.</li>\n<li>Recreate projects causing the problem from scratch.</li>\n<li>Reboot.</li>\n</ul>\n\n<p>I have two WinForms projects in the solution. One of them loads the debug info, one doesn't. They both refer to the assembly I'm trying to get debug info on in exactly the same way in the project file. Any ideas?</p>\n\n<hr>\n\n<p>I want to add in here, mostly for myself when I come back to review this question, that symbols are not loaded until the assembly is loaded, and the assembly is not loaded until it is needed. If the breakpoint is in a library that is only used in one function in your main assembly, the symbols will not be loaded (and it will show the breakpoint as not being hit) until that function is called.</p>\n", "answer": "Start debugging, as soon as you've arrived at a breakpoint or used Debug >\nBreak All, use Debug > Windows > Modules. You'll see a list of all the\nassemblies that are loaded into the process. Locate the one you want to get\ndebug info for. Right-click it and select Symbol Load Information. You'll get\na dialog that lists all the directories where it looked for the .pdb file for\nthe assembly. Verify that list against the actual .pdb location. Make sure it\ndoesn't find an old one. In normal projects, the assembly and its .pdb file\nshould always have been copied by the IDE into the same folder as your .exe.\nThe bin\\Debug folder of your project. Make sure you remove one from the GAC if\nyou've been playing with it.\n\n", "question_id": 2155930}, {"question_score": 38, "title": "What's the difference between Visual Studio Community and other, paid versions?", "answer_score": 26, "question_body": "<p>What's missing in Visual Studio Community 2015? They say it's full-featured and <em>free</em>, but if that's the case, then why do/will they still sell Visual Studio Ultimate 2015 or Visual Studio Enterprise 2015 for 6 grand?</p>\n\n<p>Something is missing in the Community preview, right? And why is it called 'Community'? My code won't be synced across your devices like the new Windows 10 update system is, will it? (Kind of joking about that last part, and kind of not, too).</p>\n", "answer": "Check the following: https://www.visualstudio.com/products/compare-visual-\nstudio-products-vs Visual studio community is free version for students and\nother academics, individual developers, open-source projects, and small non-\nenterprise teams (see \"Usage\" section at bottom of linked page). While\nVSUltimate is for companies. You also get more things with paid versions!\n\n", "question_id": 30285135}, {"question_score": 87, "title": "Visual C++: How to disable specific linker warnings?", "answer_score": 58, "question_body": "<p>I'm using a library from CGAL which during the linking stage of my code compilation produces a lot of linking warnings of this form:</p>\n\n<pre><code>warning LNK4099: PDB 'vc80.pdb' was not found with 'gmp-vc80-mt-sgd.lib' or at 'vc80.pdb'; linking object as if no debug info\n</code></pre>\n\n<p>How do I turn off this specific linker warning under Visual C++/Studio 2008?</p>\n\n<p>Note that I do not have any control on the external (CGAL) library which I am using. I cannot/donot want to get into recompiling the external library. Hence, the need to fix the messages at my end.</p>\n", "answer": "Add the following as a additional linker option: /ignore:4099 This is in\nProperties->Linker->Command Line\n\n", "question_id": 661606}, {"question_score": 29, "title": "Random assembly references fail (\"Are you missing a using directive or an assembly reference?\")", "answer_score": 58, "question_body": "<p>My application has a mixture of 3.5 and 4.0-targeted assemblies.  I'm working on a new Windows service targeting 4.0 and the project suddenly seems unable to see some of the other assemblies in the solution.  Meaning, on build, all references to these certain other assemblies produce the following error:</p>\n\n<blockquote>\n  <p>The type or namespace name '[X]' does not exist in the namespace '[Y]' (are you missing an assembly reference?)</p>\n</blockquote>\n\n<p>If I delete the project reference and re-add it, the red squigglies go away and Intellisense kicks in again like it's supposed to.  All of the other projects in the solution build without issue.  <strong>But as soon as I try to build this new project, the errors come back.</strong></p>\n\n<p>One of the failing references is to our Core.dll, which targets 3.5.  We recently added a CoreEx.dll targeting 4.0, with namespace sharing between the assemblies.  The new service can see CoreEx.dll but not Core.dll... i.e., when I begin typing <code>using Core.Utilities...</code> Intellisense picks up on the smaller set of namespaces from CoreEx.dll but does not show any that appear only in Core.dll.  I'm pretty sure the solution built successfully after adding this, but it's a notable recent change.</p>\n\n<p>Another failing reference is to our core Data.dll which holds a bunch of datasets and Entity Framework stuff.  This one was recently migrated to 4.0.  Again, I'm almost positive the solution built after migrating the project, but it's worth mentioning.</p>\n\n<p>The last failing reference is an assembly that uses the namespace one level \"up\" from the service.  E.g., the problematic project is based out of namespace <code>ProductName.Component.ComponentService</code> and it is unable to see the project based out of namespace <code>ProductName.Component</code>.  This one was recently created along with the problematic project and also targets 4.0.</p>\n\n<p>As you can see, there doesn't seem to be any rhyme or reason to which assembly references are failing... and the problematic project can successfully reference <em>some</em> of the other assemblies in the solution.  I've tried cleaning, re-building, restarting Visual Studio... nothing has fixed it permanently.  What could be causing this?</p>\n", "answer": "Check the target platform of the new project and make sure it's not targeting\n.NET 4 Client Profile. If it is, change it to regular .NET 4\n\n", "question_id": 5825867}, {"question_score": 79, "title": "Visual Studio keyboard shortcut to display intellisense", "answer_score": 110, "question_body": "<p>What's the keyboard shortcut for VS2005/2008 to display intellisense box if accidentally hit <kbd>ESC</kbd> and want the box come back again? Thanks.</p>\n", "answer": "Ctrl \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\+ Space or Ctrl \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\+ J You can also go to Tools > Options > Environment\n> Keyboard and check what is assigned to these shortcuts. The command name\nshould be Edit.CompleteWord.\n\n", "question_id": 3640544}, {"question_score": 96, "title": "Visual Studio Editor does not underline errors anymore", "answer_score": 205, "question_body": "<p>My Visual Studio (2008) Editor has stopped to underline Errors (this nifty wavy red lines). I can't really tell when, but it can be related to the installation of .Net Framework 3.5 SP 1 or the MVC Beta (which I guess is unlikely). Furthermore have I installed and uninstalled both CodeRush and Resharper for evaluation purposes (decided not to keep either one of them).</p>\n\n<p>Does anyone know the problem and how to restore this functionality again?</p>\n", "answer": "<p>Have you checked <kbd>Tools</kbd>→<kbd>Options...</kbd>→<kbd>Text Editor</kbd>→<kbd>C#</kbd>→<kbd>Advanced</kbd>→<kbd>Underline errors in the editor</kbd>?</p>\n\n<p>I usually like to reset my settings after messing around with plugins, as they tend to mess with settings: <kbd>Tools</kbd>→<kbd>Import and Export Settings...</kbd>→<kbd>Reset all settings</kbd>.</p>\n", "question_id": 267843}, {"question_score": 56, "title": "Refactor Menu Missing from Visual Studio 2015", "answer_score": 62, "question_body": "<p>I am having trouble finding the right-click context menu in Visual Studio 2015. I know that nothing is wrong with my project or the file I am working. I can find the right-click context refactor menu in Visual Studio 2013. However, in Visual Studio 2015 there isn't a refactor context menu in the right-click context menu.</p>\n\n<p>Where did it go? How do I get it back?</p>\n\n<p>Your suggestion cannot include \"Edit->Refactor\".</p>\n\n<p><em>Edit</em>\nI have tried to reset my visual studio settings back to default using Tools->Import and Export Settings and that didn't bring the menu back either. </p>\n", "answer": "Some of the refactoring tools have been relocated or at least accessible in a\ndifferent manner than they were previously. Using the extract method refactor\nas an example, you can still utilize this function, it is just not done the\nsame as before: ![Select parts to\nextract](http://i.stack.imgur.com/02w4Am.png) Right click ![Right\nclick](http://i.stack.imgur.com/vKwpQm.png) Quick actions ![Quick\nactions](http://i.stack.imgur.com/m1UVrm.png) Click extract Method ![Click\nextract method](http://i.stack.imgur.com/Ds7agm.png) I think they've changed\nit to feel more \"ReSharper\"ey. All of the functionality should still be there\nhowever. Here's more information on refactoring in VS2015 - hopefully this\nhelps! https://msdn.microsoft.com/en-us/library/719exd8s.aspx\n\n", "question_id": 31615057}]